Repository: BackupTheBerlios/tinyavi-svn
Catalog: trunk/po/*.po
Languages: be, ru

source: TinyAVI video converter
be: TinyAVI Відэа Канвертар
ru: Преобразователь видеофайлов TinyAVI

source: Add new video files to the queue
be: Дадаць новыя відэа файлы ў чаргу
ru: Добавить новые видеофайлы в очередь

source: Remove selected video files from the encoding queue
be: Выдаліць вылучаныя відэа файлы з чаргі
ru: Удалить выбранные файлы из очереди

source: Play selected file with current settings (on-the-fly conversion)
be: Прайграць файл, выкарыстоўваючы цяперашнія налады (канвертаванне на лёце)
ru: Проиграть файл, используя текущие настройки (преобразование на лету)

source: Convert selected file only
be: Канвертаваць толькі вылучаны файл
ru: Преобразовать выделенные файлы

source: Stop converting selected file only
be: Спыніць канвертаванне толькі вылучанага файла
ru: Остановить преобразование выделенных файлов

source: Select the device on which you're going to watch the resulting video. The program will automatically choose the most optimal encoding settings for your device.
be: Выберыце прыладу на якой вы збіраецеся глядзець выніковае відэа. Праграма аўтаматычна выбера найбольш аптымальныя наладкі кадавання для вашай прылады.
ru: Выберите устройство, на котором Вы собираетесь смотреть результат. Программа автоматически подберёт наилучшие настройки кодирования, подходящие Вашему устройству.

source: <b>Target device</b>
be: <b>Мэтавая прылада</b>
ru: <b>Целевое устройство</b>

source: The balance between resulting video quality and size. If you want smaller files, choose low quality and vice versa.
be: Баланс паміж выніковай якасцю і памерам. Калі вы жадаеце меншыя файлы, выберыце нізкую якасць, і наадварот.
ru: Баланс между качеством результирующего видео и размером. Если Вам важен малый размер файла, выберите низкое качество и наоборот.

source: Low/Small Medium/Medium High/Large
be: Нізкая/Маленькі Сярэдняя/Сярэдні Высокая/Вялікі
ru: Низкое/Маленький Среднее/Средний Высокое/Большой

source: <b>Quality/Size</b>
be: <b>Якасць/Памер</b>
ru: <b>Качество/Размер</b>

source: De_interlace
be: Дэінтэрлэйсаваць
ru: Убрать _черезстрочность

source: Check this if you want a deinterlace filter to be applied on the input video.
be: Абярыце, калі вы жадаеце ўжыць дэінтэрлэйс фільтр да ўваходнага відэа.
ru: Пометьте, если хотите убрать черезстрочность во входном видео.

source: De_noise
be: Падавіць _шум
ru: Подавить _шум

source: Check this if you want to apply a light denoise filter on the input video.
be: Абярыце, калі вы жадаеце дадаць лёгкі дэінтэрлэйс фільтр да ўваходнага відэа.
ru: Пометьте, если хотите наложить лёгкий шумоподавитель на входное видео.

source: _Sharpen
be: _Рэзкасць
ru: _Резкость

source: Check this if you want to increase a bit the sharpness of the resulting video. NOTE: this comes for the cost of approximatively 1.5 longer encoding time.
be: Абярыце, калі вы жадаеце павялічыць рэзкасць выніковага відэа. ЗАЎВАГА: Час канвертавання павялічыцца прыкладна ў 1.5 раз.
ru: Пометьте, если хотите слегка увеличить резкость получаемого на выходе видео. ВНИМАНИЕ: это даст более хороший результат, но приведёт к увеличению времени кодирования примерно в полтора раза.

source: Extra filters:
be: Дадатковыя фільтры:
ru: Доп. фильтры:

source: Extra video filters to prepend to the list. The format is exactly the same as in the -vf option of mencoder.
be: Дадатковыя відэа фільтры, устаўляюцца ў пачатак спіса. Фармат фільтраў такі самы, як у наладцы -vf mencoder'a
ru: Дополнительные фильтры видео, вставляются перед. основным списком. Формат фильтров такой же, как в опции -vf mencoder'а

source: <b>Video settings</b>
be: <b>Відэа наладкі</b>
ru: <b>Настройки видео</b>

source: _Passthrough
be: Без змены
ru: _Без преобразования

source: Check this if you don't want audio track to be re-encoded at a lower bitrate.
be: Абярыце, калі вы не жадаеце каб аўдыё сцежка была перакадавана з горшай якасцю.
ru: Пометьте, если не хотите чтобы звуковая дорожка была перекодирована с более низким качеством.

source: N_ormalize
be: _Нармалізаваць
ru: _Нормализовать

source: Check this if you want to normalize the volume of the audio track. Usually this is a good idea, especially if the original uses multi-channel ac3 audio.
be: Абярыце, калі вы жадаеце нармалізаваць гучнасць аўдыё сцежцы. Звычайна гэта добрая ідэя, асабліва калі зыходны файл выкарыстоўвае многаканальнае ac3 аўдыё.
ru: Пометьте, если хотите нормализовать громкость аудиодорожки. Обычно это хорошая идея для любого видео, в особенности если исходный файл использует многоканальное ac3 аудио.

source: Extra audio filters to prepend to the list. The format is exactly the same as in the -af option of mencoder.
be: Дадатковыя аўдыё фільтры, устаўляюцца ў пачатак спіса. Фармат фільтраў такі самы, як у наладцы -af mencoder'a
ru: Дополнительные фильтры аудио, вставляются перед основным списком. Формат фильтров такой же, как в опции -af mencoder'а.

source: <b>Audio settings</b>
be: <b>Аўдыё наладкі</b>
ru: <b>Настройки звука</b>

source: Number of CPUs to use:
be: Колькасць CPU:
ru: Количество процессоров:

source: Number of simultaneous conversion processes to start
be: Колькасць адначасовых працэсаў канвертавання
ru: Количество одновременно запущенных процессов преобразования

source: Target device screen width
be: Шырыня экрана мэтавай прылады
ru: Ширина экрана целевого устройства

source: Target device screen height
be: Вышыня экрана мэтавай прылады
ru: Высота экрана целевого устройства

source: Note: The final video size may be different due to movie aspect ratio. This setting just defines the screen size of your target device.
be: Заўвага: Выніковы памер кадра можа быць іншым з за суадносін аспекту. Гэта наладка проста вызначае памер экрана вашай мэтавай прылады.
ru: Внимание: Размер конечного файла может быть несколько другим по причине учёта соотношения сторон исходного видеофайла. Эта настройка просто задаёт размер экрана целевого устройства.

source: <b>Target device screen size</b>
be: <b>Памер экрана мэтавай прылады</b>
ru: <b>Размер экрана устройства</b>

source: Output file name:
be: Імя выхаднога файла:
ru: Название выходного файла:

source: The rule to build output file name. %(dir)s will be replaced with the directory of the original file %(name)s will be replaced with original file name %(ext)s will be replaced with default extension
be: Правіла пабудовы выхаднога імя файла. %(dir)s будзе зменена на дырэкторыю зыходнага файла %(name)s будзе зменена на імя зыходнага файла %(ext)s будзе зменена на прадвызначанае пашырэнне
ru: Правило построения имени выходного файла. %(dir)s будет заменён на каталог исходного файла %(name)s будет заменён на имя исходного файла %(ext)s будет заменён на расширение по умолчанию

source: Output directory:
be: Дырэкторыя для вынікаў:
ru: Каталог результата:

source: The directory where to put output files. If left empty, the output file will be created in the same directory where the original is, with the "-tiny" suffix appended to its name.
be: Дырэкторыя для выхадных файлаў Калі пакінуць пустой, выхадны файл будзе створаны у дырэкторыі дзе знаходзіцца зыходны файл, да імя файла будзе дададзены суфікс "-tiny".

source: Choose a directory where to put the output files
be: Вызначыце дырэкторыю для выхадных файлаў
ru: Выберите каталог, куда будет записан результат

source: Settings
be: Наладкі
ru: Настройки

source: Add a new video file to the queue
be: Дадаць новы відэа файл у чаргу
ru: Добавить новый видеофайл в очередь

source: About TinyAVI
be: Пра TinyAVI
ru: О программе TinyAVI

source: Copyright (C) 2008-2010 Andrew Zabolotny
be: Аўтарскае права (C) 2008-2010 Андрэй Забалотны

source: The easy video converter for portable devices Dedicated to my daughter Alice
be: Просты відэа канвертар для мабільных прылад Прысвячаецца маёй дачцэ Алісе
ru: Простой видеоконвертер для переносных устройств Посвящается моей дочке Алисе

source: Go to homepage
be: Перайсці на хатнюю старонку
ru: Посетить домашнюю страницу

source: Select directory for output files
be: Вылучыце дырэкторыю для выхадных файлаў

source: Adding %(desc)s filter: %(filt)s
be: Дадаём %(desc)s фільтр: %(filt)s
ru: Добавляем %(desc)s фильтр: %(filt)s

source: Finding video crop and size ...
be: Знаходзім памер кадра і яго запоўненую частку ...
ru: Определяем кадрирование и размер ...

source: UNEXPECTED ERROR: video size too small
be: НЕЧАКАНАЯ ПАМЫЛКА: памер кадра надта маленькі
ru: НЕОЖИДАННАЯ ОШИБКА: размер видео слишком мал

source: Analysing file %s
be: Аналізуем файл %s
ru: Анализируем файл %s

source: ERROR: file `%s' does not exist or is not readable
be: ПАМЫЛКА: файл `%s' не існуе або не прыдатны да чытання
ru: ОШИБКА: файл `%s' не существует или недоступен

source: ERROR: Quality value is not allowed (%d)
be: ПАМЫЛКА: Недапушчальнае значэнне якасці (%d)
ru: ОШИБКА: Неверное значение для качества (%d)

source: ERROR: unknown target profile `%s'
be: ПАМЫЛКА: невядомы профіль `%s'
ru: ОШИБКА: выбран неизвестный профиль `%s'

source: Using target profile `%s'
be: Выкарыстоўваецца профіль `%s'
ru: Используется профиль `%s'

source: Invalid output file mask: %s
be: Няправільная маска выхаднога файла: %s
ru: Ошибочная маска выходного файла: %s

source: Resulting video file: %s
be: Атрыманы відэа файл: %s
ru: Перекодированный файл: %s

source: ERROR: failed to determine video/crop width and/or height
be: ПАМЫЛКА: немагчыма вызначыць памер кадра ці яго запоўненай часткі
ru: ОШИБКА: не могу определить размер кадра, либо размер его заполненной части

source: video
be: відэа
ru: видео

source: audio
be: аўдыё
ru: аудио

source: Analysing finished
be: Аналіз скончаны
ru: Анализ завершён

source: FATAL: Could not find data directory
be: ПАМЫЛКА: Немагчыма знайсці дырэкторыю з данымі
ru: ОШИБКА: Не могу найти каталог с данными

source: Stopped
be: Спынены
ru: Остановлено

source: Queued
be: У чарзе
ru: В очереди

source: Playing
be: Прайграваецца
ru: Проигрывается

source: Done
be: Зроблена
ru: Готово

source: Error
be: Памылка
ru: Ошибка

source: Aborted
be: Спынена
ru: Прервано

source: Video files
be: Відэа файлы
ru: Видео файлы

source: All files
be: Усе файлы
ru: Все файлы

source: TinyAVI GUI started ... Now add some files to the queue and press `Convert All'
be: TinyAVI GUI запушчаны ... Дадайце файлы ў чаргу, і націсніце `Канвертаваць Усё'
ru: Программа TinyAVI GUI запущена ... Теперь добавьте файлов в очередь и жмите `Преобразовать Всё'

source: Video file name
be: Імя відэа файла
ru: Название видеофайла

source: Status
be: Стан
ru: Состояние

source: Failed to save configuration file: %s
be: Немагчыма захаваць файл канфігурацыі: %s
ru: Не удалось сохранить файл конфигурации: %s

source: %prog [options] [file.avi[ ...]]
be: %prog [опцыі] [file.avi[ ...]]
ru: %prog [опции] [файл.avi[ ...]]

source: Redirect output to FILE
be: Перакіраваць вывад у файл
ru: Задать имя выходного файла

source: Target profile (default="%(def)s") (you can use a substring of the preset name, or preset id). Available presets: %(pres)s.
be: Мэтавы профіль (прадвызначаны="%(def)s") (вы можаце выкарыстоўваць падрадок назвы профіля ці яго ідэнтыфікатар). Даступныя профілі: %(pres)s.
ru: Целевое устройство (по умолчанию="%(def)s") (можно указать лишь подстроку названия, либо идентификатор). Доступные профили: %(pres)s

source: Display a detailed list of supported targets
be: Паказаць дэталізаваны спіс падтрымліваемых профіляў канвертавання

source: Target video width in pixels
be: Пажаданая шырыня відэа ў кропках
ru: Желаемая ширина выходного видео в пикселах

source: Physical screen width in pixels
be: Фізічная шырыня відэа ў кропках
ru: Физическая ширина экрана в пикселях

source: Target video height in pixels
be: Пажаданая вышыня відэа ў кропках
ru: Желаемая высота выходного видео в пикселах

source: Physical screen height in pixels
be: Фізічная вышыня экрана ў кропках
ru: Физическая высота экрана в пикселях

source: Define additional video filters
be: Задаць дадатковыя відэа фільтры
ru: Задать дополнительные видеофильтры

source: Define additional audio filters
be: Задаць дадатковыя аўдыё фільтры
ru: Задать дополнительные аудиофильтры

source: Apply hqdn3d denoise filter
be: Прымяніць hqdn3d анты-шумавы фільтр
ru: Обработать шумоподавителем hqdn3d

source: Apply deinterlace filter
be: Прымяніць дэінтэрлэйс фільтр
ru: Убрать черезстрочность видео

source: Sharpen the video
be: Павялічыць рэзкасць відэа
ru: Увеличить резкость изображения

source: Encode given audio stream
be: Закадаваць дадзены гукавы паток
ru: Выбрать аудиопоток по номеру

source: Pass-through the audio channel (no encoding)
be: Капіраваць гук у выхадны файл без кадавання
ru: Копирование аудио в результат без перекодирования

source: Normalize the volume of the audio track
be: Нармалізаваць гучнасць аўдыё сцежцы
ru: Нормализовать громкость аудиодорожки

source: Create a script instead of running mencoder directly
be: Стварыць скрыпт замест непасрэднага запуску mencoder
ru: Создать сценарий вместо запуска на кодирование

source: Play the converted video in real-time instead of converting
be: Прайграць заканвертаванае відэа на лёце замест канвертавання
ru: Показать примерный вид конечного видео (без перекодирования)

source: Balance between file size and quality: 0..2 = low..high quality = small..large size
be: Баланс паміж велічынёй файла і якасцю: 0..2 = нізкая...высокая якасць = маленькі..вялікі памер
ru: Баланс между размером и качеством: 0..2 = низкое..высокое качество = маленький..большой размер

source: Here goes the list of supported target profiles:
be: Спіс падтрымліваемых профіляў канвертавыння:

source: Nothing to do, exiting; use --help for command-line format
be: Няма чаго рабіць, выходзім; выкарыстайце --help, каб убачыць фармат каманднага радка
ru: Операция не задана; используйте --help чтобы увидеть формат командной строки

source: Creating encoding script ...
be: Ствараем скрыпт канвертавання ...
ru: Создаём сценарий преобразования ...

source: Starting conversion process ...
be: Пачынаем працэс канвертавання ...
ru: Начинаем процесс преобразования ...

source: ERROR: conversion unsuccessful
be: ПАМЫЛКА: канвертаванне завяршылася непаспяхова
ru: ОШИБКА: преобразование не удалось

source: All done
be: Усё зроблена
ru: Процесс завершён

source: The directory where to put output files. If left empty, the output file will be created in the same directory where the original is, with the "_tiny" suffix appended to its name.
ru: Каталог для выходных файлов. Если оставить пустым, выходной файл будет создан в каталоге оригинала, но с прибавленным к имени суффиксом "_tiny".

source: Copyright (C) 2008 Andrew Zabolotny
ru: Авторское право (C) 2008 Андрей Заболотный
